04_Simulation/PH_Cases/Mesh_120_by_130/Test_MHI_Fluent_MESH/steadyState_2D_Baseline_RANS_SST/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
15600
(
(6.6666667e-11 -3.1e-11 -2.616243e-32 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -3.1e-11 -0 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -1.1526672e-26 3.2837612e-30 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -0 -6.6953834e-32 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -1.4328812e-25 2.5496107e-31 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -0 -0 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -4.6072115e-26 -1.8792573e-30 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 -0 -1.8205766e-31 6.6666667e-11 -0 6.6666667e-11)
...
)
;

boundaryField
{
    hills
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 -0 -0 6.6666667e-11 -0 6.6666667e-11);
    }
    top
    {
        type            fixedValue;
        value           uniform (6.6666667e-11 0 -0 6.6666667e-11 -0 6.6666667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
