04_Simulation/PH_Cases/Mesh_120_by_130/Test_MHI_Fluent_MESH/steadyState_2D_Baseline_RANS_SST/0/wallGradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallGradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(2.0043905 -0 -0)
(2.0000924 -0 -0)
(2.000578 -0 -0)
(2.000346 -0 -0)
(2.0030159 -0 -0)
(2.0040789 -0 -0)
(2.0048366 -0 -0)
(2.0049154 -0 -0)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
(2 -0 -0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
