04_Simulation/PH_Cases/Mesh_120_by_130/Test_MHI_Fluent_MESH/steadyState_2D_Baseline_RANS_SST/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RASModel;


    RASModel              kOmegaSST ;// kOmegaSSTKCIModelsComb; //; //kOmegaSST;

    turbulence          on;

    printCoeffs         on;
    
    
      kOmegaSSTKCIModelsCombCoeffs {
       model linear; // you need to also run the other model Tr.prod.squCyl.Iter0.region_Ha1Ha4
       //betaStar 0.082;

       } 

         
// ************************************************************************* //
